driver-tests/bpelse/dynamicpartnerlink/correlation/MatchingInstanceTwoCorrJBI/test/rec_pick_correlate_any/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <helloObj xmlns="http://xml.netbeans.org/schema/dataTypes.xsd">
      <dat:recursive xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">
        <dat:recursive/>
        <dat:int>3</dat:int>
        <dat:long>10</dat:long>
        <dat:float>?1.5E2?</dat:float>
      </dat:recursive>
      <dat:string xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?string? create sub instance  after create instance   first pick  after first pick   second receive  after correlating receive   receive in flow  after flow receive  after invoke request response  after invoke request  after invoke response   pick in scope  after pick   evt handler  after evt hdlr </dat:string>
      <dat:nonNegativeInteger xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?200?</dat:nonNegativeInteger>
      <dat:byte xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?2?</dat:byte>
      <dat:short xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?1?</dat:short>
      <dat:int xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?3?</dat:int>
      <dat:long xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?10?</dat:long>
      <dat:negativeInteger xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?-201?</dat:negativeInteger>
      <dat:dateTime xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?2008-09-28T18:49:45?</dat:dateTime>
      <dat:nonPositiveInteger xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?-200?</dat:nonPositiveInteger>
      <dat:duration xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?P1Y2M6DT14H25M13S?</dat:duration>
      <dat:ENTITIES xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">??string??</dat:ENTITIES>
      <dat:double xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?1.051732E7?</dat:double>
      <dat:ENTITY xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?string?</dat:ENTITY>
      <dat:float xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?1.5E2?</dat:float>
      <dat:Element30 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">??string??</dat:Element30>
      <dat:integer xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?100?</dat:integer>
      <dat:decimal xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?1000.00?</dat:decimal>
      <dat:boolean xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?false?</dat:boolean>
      <dat:Element2 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?string?</dat:Element2>
      <dat:Element1 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?string?</dat:Element1>
      <dat:Element29 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?string?</dat:Element29>
      <dat:Element28 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?string?</dat:Element28>
      <dat:Element27 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?string?</dat:Element27>
      <dat:Element26 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?string?</dat:Element26>
      <dat:Element25 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">??string? ?string??</dat:Element25>
      <dat:Element24 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?string?</dat:Element24>
      <dat:Element23 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?string?</dat:Element23>
      <dat:Element22 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?token?</dat:Element22>
      <dat:Element20 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?qname?</dat:Element20>
      <dat:Element19 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?http://www.any.com/circum/regemque?</dat:Element19>
      <dat:Element18 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?bmltYm9ydW0=?</dat:Element18>
      <dat:Element17 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?6672656D756E74?</dat:Element17>
      <dat:Element16 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?--09-07:00?</dat:Element16>
      <dat:Element15 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?---14?</dat:Element15>
      <dat:Element14 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?--03-18?</dat:Element14>
      <dat:Element13 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?2018-08:00?</dat:Element13>
      <dat:Element12 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?2017-11-07:00?</dat:Element12>
      <dat:Element11 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?2014-06-10-07:00?</dat:Element11>
      <dat:Element10 xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">?23:56:46-08:00?</dat:Element10>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
