driver-tests/bpelse/assign/Assign2JBI/test/DollarInAttribute/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">
  <soapenv:Body>
    <dat:helloObj>
      <!--Zero or more repetitions:-->
      <dat:recursive>
          <dat:string newAttribute="FirstInputAttribute">FirstValue</dat:string> 
          <dat:string newAttribute="$Attribute">SecondValue</dat:string>
      </dat:recursive>
      <!--Zero or more repetitions:-->
      <dat:string newAttribute="?string?">?string?</dat:string>
      <!--Zero or more repetitions:-->
      <dat:nonNegativeInteger>?200?</dat:nonNegativeInteger>
    </dat:helloObj>
  </soapenv:Body>
</soapenv:Envelope>