driver-tests/bpelse/assign/AtomicAssignJBI/test/atomicCopy/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <helloObj xmlns="http://xml.netbeans.org/schema/dataTypes.xsd">
      <dat:string xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">string</dat:string>
      <dat:int xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">2</dat:int>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
